In [11]:
import random
z=random.randint(1,10)
if z%2==0:
    print(str(z)+" is even")
else:
    print(str(z)+" is odd")

7 is odd

In [3]:
x=random.randint(1,30)
if x%2==0:
    print(str(x)+" is divided by 2")
elif x%3==0:
    print(str(x)+" is divided by 3")
else:
    print(str(x)+" is neither divided by 2 or 3")

24 is divided by 2

In [4]:
import pandas as pd
import numpy as np
brics=pd.read_csv('brics.csv',index_col=0)
brics

    country    capital   area  population
BR   Brazil   Brasilia   8.90       200.4
RU   Russia     Moscow  14.60       147.5
GR  Germany     Berlin   5.60        60.5
IN    India  New Delhi   5.46      1225.0
NW   Norway       Olso   5.67        80.6

In [5]:
#select country with area greater than 8 million km
brics["area"]
brics.loc[:,'area']
brics.iloc[:,2]

BR     8.90
RU    14.60
GR     5.60
IN     5.46
NW     5.67
Name: area, dtype: float64

In [6]:
is_huge=brics['area']>8
brics[is_huge]

   country   capital  area  population
BR  Brazil  Brasilia   8.9       200.4
RU  Russia    Moscow  14.6       147.5

In [7]:
#select country with area between than 8 million km and 10 million km
is_between=np.logical_and(brics.loc[:,'area']>8,brics.loc[:,'area']<10)
is_between

BR     True
RU    False
GR    False
IN    False
NW    False
Name: area, dtype: bool

In [15]:
brics[is_between]

   country   capital  area  population
BR  Brazil  Brasilia   8.9       200.4

In [8]:
cars=pd.read_csv('cars.csv',index_col=0)
cars

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JP           Japan         False           588
IN           India         False            18
RU          Russia          True           200
MAR        Morocco          True            70
EG           Egypt          True            45

In [22]:
#dr=cars['drives_right']
sel = cars[cars['drives_right']]
sel

           country  drives_right  cars_per_cap
US   United States          True           809
RU          Russia          True           200
MAR        Morocco          True            70
EG           Egypt          True            45

In [23]:
cars_maniac=cars[cars['cars_per_cap']>500]
cars_maniac

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JP           Japan         False           588

In [25]:
cpc=cars['cars_per_cap']
medium=np.logical_and(cpc>100,cpc<500)
cars[medium]

   country  drives_right  cars_per_cap
RU  Russia          True           200

In [9]:
cars

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JP           Japan         False           588
IN           India         False            18
RU          Russia          True           200
MAR        Morocco          True            70
EG           Egypt          True            45

In [10]:
between=np.logical_and(cars['cars_per_cap']>200,cars['cars_per_cap']<600)
cars[between]

   country  drives_right  cars_per_cap
JP   Japan         False           588

In [12]:
fam = [3, 4, 5, 67, 8, 9]
for index, h in enumerate(fam):
    print("index " + str(index) + " height: " + str(h))

index 0 height: 3
index 1 height: 4
index 2 height: 5
index 3 height: 67
index 4 height: 8
index 5 height: 9